# GetCategoryId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..GetCategoryId Method
ElementRecord Class See Also
---
Gets the category id of the element record.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GetCategoryId()
```

Visual Basic
---
```text
Public Function GetCategoryId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetCategoryId()
```

# ### Return Value
The category id.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace